## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_cognitive_account.example must be replaced
-/+ resource "azurerm_cognitive_account" "example" {
      ~ custom_subdomain_name              = "jpdomainprod" -> "example-openai2" # forces replacement
      - dynamic_throttling_enabled         = false -> null
      ~ endpoint                           = "https://jpdomainprod.openai.azure.com/" -> (known after apply)
      - fqdns                              = [] -> null
      ~ id                                 = "/subscriptions/43d4dcea-8c79-4797-9e06-44006577b8b6/resourceGroups/rg-tf-github-prod/providers/Microsoft.CognitiveServices/accounts/prodoaitfjpexample" -> (known after apply)
        name                               = "prodoaitfjpexample"
      ~ primary_access_key                 = (sensitive value)
      ~ secondary_access_key               = (sensitive value)
      ~ tags                               = {
          + "costcenter"  = "11235"
            "environment" = "prod"
        }
        # (7 unchanged attributes hidden)
    }

  # azurerm_cognitive_deployment.example must be replaced
-/+ resource "azurerm_cognitive_deployment" "example" {
      ~ cognitive_account_id = "/subscriptions/43d4dcea-8c79-4797-9e06-44006577b8b6/resourceGroups/rg-tf-github-prod/providers/Microsoft.CognitiveServices/accounts/prodoaitfjpexample" # forces replacement -> (known after apply) # forces replacement
      ~ id                   = "/subscriptions/43d4dcea-8c79-4797-9e06-44006577b8b6/resourceGroups/rg-tf-github-prod/providers/Microsoft.CognitiveServices/accounts/prodoaitfjpexample/deployments/example-cd" -> (known after apply)
        name                 = "example-cd"

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>